Revit 2027 API
IndexStreamTriangle.AddTriangles Method
 Inserts multiple IndexTriangle instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddTriangles(
	IList<IndexTriangle> triangles
)
Public Sub AddTriangles (
	triangles As IList(Of IndexTriangle)
)
public:
void AddTriangles(
	IList<IndexTriangle^>^ triangles
)
member AddTriangles :
        triangles : IList<IndexTriangle> -> unit
Parameters
triangles IList<IndexTriangle>
 The triangles to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace